// Задание 1
// var Tc = prompt("Введите температуру в Цельсиях");
// var Tf = (9 / 5) * Tc + 32;
// alert("Температура по Фаренгейту " + Tf);

// Задание 2
// var name = ("\"Василий\"");
// var admin = name;
// alert(admin);

// Задание 4
// var a = 1000;
// var b = "108";
// var c = a + b;
// alert(c);

// Задание 5
// Своими словами - скрипты с async будут отображаться по мере загрузки, кто быстрее загрузится тот и отобразится первым. При использовании defer событие будет ждать выполнение скрипта с defer и выполнится после его загрузки.